public class Employee
{
  
    private  String ονομ_επ;
    private  String βαθμιδα_εκπ;
    
    private  int μεταπτυ_σπουδ;
    private  int ετη_υπηρε;
    private  boolean εγγαμοσ_αγαμοσ;
    private  int αριθμ_ανηλ_παιδ;
    private  int μισθος;
    private  int επιδομα;
    /* 
     * Κατασκευαστή της κλάσης
     */
    public Employee(String ΟΝΟΜ_ΕΠ , String ΒΑΘΜΙΔΑ_ΕΚΠ ,   int ΜΕΤΑΠΤΥ_ΣΠΟΥΔ , int ΕΤΗ_ΥΠΗΡΕ , boolean ΕΓΓΑΜΟΣ_ΑΓΑΜΟΣ , int ΑΡΙΘΜ_ΑΝΗΛ_ΠΑΙΔ 
    , int ΜΙΣΘΟΣ   )
    {
      ονομ_επ = ΟΝΟΜ_ΕΠ ;
      βαθμιδα_εκπ = ΒΑΘΜΙΔΑ_ΕΚΠ ;
      
      μεταπτυ_σπουδ = ΜΕΤΑΠΤΥ_ΣΠΟΥΔ;
      εγγαμοσ_αγαμοσ = ΕΓΓΑΜΟΣ_ΑΓΑΜΟΣ;
      ετη_υπηρε = ΕΤΗ_ΥΠΗΡΕ;
    
      αριθμ_ανηλ_παιδ = ΑΡΙΘΜ_ΑΝΗΛ_ΠΑΙΔ;
      μισθος = ΜΙΣΘΟΣ;
      επιδομα=0;
    
    }
    /*
     * Μεθόδους (πρόσβασης - accessors/getters)
     */  
    public String getονομ_επ()
    {
        return ονομ_επ;     
    
    }
    
     public String βαθμιδα_εκπ()
    {
        return βαθμιδα_εκπ;     
    
    }
    
    public int μεταπτυ_σπουδ()
    {
        return μεταπτυ_σπουδ;     
    
    }
    
    public int ετη_υπηρε()
    {
        return ετη_υπηρε;     
    
    }
    
     public boolean εγγαμοσ_αγαμοσ()
    {
        return εγγαμοσ_αγαμοσ;     
    
    }
    
    public int αριθμ_ανηλ_παιδ()
    {
        return αριθμ_ανηλ_παιδ;     
    
    }
    
    public int μισθος()
    {
        return μισθος;     
    
    }
    
    public int επιδομα()
    {
        return επιδομα;     
    
    }
    /*
     * Μεθόδους (μετάλλαξης – mutators/setters)
     */
    public void setβαθμιδα_εκπ (String βαθμιδα)
    {
       /* if ( βαθμιδα.equals("ΥΕ") || βαθμιδα.equals("ΔΕ") || βαθμιδα.equals("ΠΕ") )

        βαθμιδα_εκπ = βαθμιδα;

        else

        System.out.println("Not a valid value for education");*/
        βαθμιδα_εκπ += βαθμιδα;
    }
    
    public void setμεταπτυ_σπουδ (int μεταπτυ)
    {
        
        μεταπτυ_σπουδ = 0;
    }
    
    public void setετη_υπηρε ()
    {
        ετη_υπηρε = ετη_υπηρε + 1;
    }
    
    public void setεγγαμοσ_αγαμοσ(boolean γαμος)
    {
        εγγαμοσ_αγαμοσ = γαμος;
    }
    
    public void setαριθμ_ανηλ_παιδ(int αριθμ)
    {
        αριθμ_ανηλ_παιδ += αριθμ;
    }
    /*
     * Μέθοδο που θα υπολογίζει και θα ενημερώνει το πεδίο για το επίδομα
     */
    public int υπολ_ενημ(int επιδ_ετος_υπηρ , int επιδ_ανηλ_πα)
    {
        int επιδ_γαμ = 0;
        int επιδ_μετα = 0 ;
        
        if (εγγαμοσ_αγαμοσ == true)
        {
            επιδ_γαμ = 50 ;
        }
        
        else if(μεταπτυ_σπουδ==1)
        {
            επιδ_μετα= 50;
        }
        else
        if(μεταπτυ_σπουδ==2)
        {
           επιδ_μετα=100;
        }
        
        επιδομα = (επιδ_ετος_υπηρ * ετη_υπηρε) + επιδ_γαμ + (αριθμ_ανηλ_παιδ + επιδ_ανηλ_πα) + επιδ_μετα;
        
        return επιδομα;
    }
    /*
     * Μέθοδο πρόσβασης που θα επιστρέφει το μηνιαίο εισόδημα
     */
    public int μην_εισ()
    {
        int μηνιαιο_εισ = μισθος + επιδομα ;
        
        return μηνιαιο_εισ ;
    
    }
    /*
     * Μέθοδο εμφάνισης των στοιχείων υπαλλήλου 
     */
    public void στοιχεια_υπαλ()
    {
        System.out.println("==========================");
        System.out.println("Ονοματεπώνημο:" + ονομ_επ);
        System.out.println("Βαθμίδα Εκπαίδευσης" + βαθμιδα_εκπ);
        
        if(μεταπτυ_σπουδ == 0)
        {
            System.out.println("Μεταπτυχιακές σπουδές: Δεν έχει");
            
            
        }
        else if (μεταπτυ_σπουδ == 1 )
        {
            System.out.println("Μεταπρυχιακές σπουδές: Μεταπτυχιακό δίπλωμα");
            
        }
        else
        {
            System.out.println("Μεταπρυχιακές σπουδές : Διδακτορικό Δίπλωμα");
            
        }
       System.out.println("Έτη υπηρεσίας:"+ ετη_υπηρε);
       if (εγγαμοσ_αγαμοσ == true)
       {
           System.out.println("Οικογενειακή κατάσταση : Εγγαμος");
           
    
       }
       else
       {
           System.out.println("Οικογενειακή κατάσταση : Αγγαμος");
           
       }
       System.out.println("Aριθμος ανηλικων παιδιων :"+ αριθμ_ανηλ_παιδ);
       System.out.println("Mισθος:"+ μισθος + "ευρω" );
       int μηνιαιο_εισ = μισθος + επιδομα ;
       System.out.println("μηνιαιο εισοδημα:"+ μηνιαιο_εισ  + "ευρω");
       
       System.out.println("====================");
       
    }

}
