/*
 * Δημιουργήστε την κλάση TestEmployee
 */
public class TestEmployee
{
    public static void main(String[] args)
    {
        /*
         * δημιουργήσετε 2 αντικείμενα-υπαλλήλους
         */
        Employee ελενη = new Employee("Ελένη Παπαδοπούλου", ":ΠΕ", 2, 25,true, 2, 1800);    
        Employee νικος = new Employee("Νίκος Παπαδόπουλος", ":ΠΕ", 1, 4,true, 2, 1200);
        /*
         * εμφανίσετε τα στοιχεία των 2 υπαλλήλων
         */
        ελενη.στοιχεια_υπαλ();
        νικος.στοιχεια_υπαλ();
        System.out.println();
        /*
         * μηδενίσετε τον αριθμό ανήλικων παιδιών
         */
        ελενη.setαριθμ_ανηλ_παιδ(0);
        /*
         * καλέσετε τη μέθοδο ενημέρωσης του επιδόματος
         */
        ελενη.υπολ_ενημ(10, 30);
        νικος.υπολ_ενημ(10, 30);

        System.out.println("*** Υπολογισμός μηνιαίου εισοδήματος του/της " + ελενη.getονομ_επ());
        ελενη.στοιχεια_υπαλ();
        
        System.out.println("*** Υπολογισμός μηνιαίου εισοδήματος του/της " + νικος.getονομ_επ());
        νικος.στοιχεια_υπαλ();

    }
}
